test_config/cfe/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДополнительныеРеквизитыИСведения</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Виден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВладелецДополнительныхЗначений</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыводитьВВидеГиперссылки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеЗначенияИспользуются</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеЗначенияСВесом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Доступен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокФормыВыбораЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокФормыВыбораЗначенияЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокФормыВыбораЗначенияЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокФормыЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокФормыЗначенияЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокФормыЗначенияЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаполнятьОбязательно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИдентификаторДляФормул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МногострочноеПолеВвода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодсказкаЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодсказкаЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФорматСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЭтоДополнительноеСведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидСвойства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСвойств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦветСвойства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦветаСвойств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_ВыгружатьНаСайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_ТипЗначенияХарактеристики</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AVS_ТипЗначенияХарактеристики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_ВариантыЗначений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_ГруппаХарактеристик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_ТипСвязки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AVS_ТипСвязки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

test_config/cfe/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура AVS_ПриИзмененииТипаЗначения(Элемент)
    
    // Управление видимостью полей в зависимости от типа
    ТипЗначения = Объект.AVS_ТипЗначенияХарактеристики;
    
    Элементы.AVS_ВариантыЗначений.Видимость = 
        (ТипЗначения = ПредопределенноеЗначение("Перечисление.AVS_ТипЗначенияХарактеристики.ОдиночныйВыбор"))
        ИЛИ (ТипЗначения = ПредопределенноеЗначение("Перечисление.AVS_ТипЗначенияХарактеристики.МножественныйВыбор"));
    
	КонецПроцедуры

// { ПРАВКА_НАЧАЛО: Логика управления метаданными для сайта }	
&НаКлиенте
Процедура AVS_ЗаполнитьВариантыИз1СКоманда(Команда)
	
	Попытка
		Сообщить("[AVS DEBUG]: Сбор данных для JSON вариантов...");
		
		Если Объект.Ссылка.Пустая() Тогда
			Сообщить("[AVS WARNING]: Сначала запишите характеристику!");
			Возврат;
		КонецЕсли;
		
		Результат = AVS_СформироватьJSONВариантовНаСервере();
		
		Если Результат.Успех Тогда
			Объект.AVS_ВариантыЗначений = Результат.JSON;
			ЭтаФорма.Модифицированность = Истина;
			Сообщить(СтрШаблон("[AVS DEBUG]: Готово. Вариантов: %1", Результат.Количество));
		Иначе
			Сообщить("[AVS WARNING]: " + Результат.Сообщение);
		КонецЕсли;
		
	Исключение
		Сообщить("[AVS ERROR]: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция AVS_СформироватьJSONВариантовНаСервере()
	
	Результат = Новый Структура("Успех, JSON, Количество, Сообщение", Ложь, "", 0, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Значения.Ссылка КАК Ссылка,
	|	Значения.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ЗначенияСвойствОбъектов КАК Значения
	|ГДЕ
	|	Значения.Владелец = &Владелец И НЕ Значения.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Если Выгрузка.Количество() = 0 Тогда
		Результат.Сообщение = "У характеристики нет значений в справочнике 'Значения свойств'.";
		Возврат Результат;
	КонецЕсли;
	
	МассивВариантов = Новый Массив;
	Для Каждого Стр Из Выгрузка Цикл
		Вариант = Новый Структура("id, value", Строка(Стр.Ссылка.УникальныйИдентификатор()), СокрЛП(Стр.Наименование));
		МассивВариантов.Добавить(Вариант);
	КонецЦикла;
	
	Результат.JSON = AVS_ВыгрузкаНаСайт.СформироватьJSONСтроку(МассивВариантов);
	Результат.Количество = МассивВариантов.Количество();
	Результат.Успех = Истина;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура AVS_ТипЗначенияХарактеристикиПриИзмененииПосле(Элемент)
	
	// { ПРАВКА: Финальная версия. Защита от ошибок имен и управление группой }
	ТекЗначение = Объект.AVS_ТипЗначенияХарактеристики;
	
	// Используем серверный метод, который определит код типа "мягким" способом
	КодТипа = AVS_ПолучитьКодТипаНаСервере(ТекЗначение);
	
	// Выводим расширенную отладку для контроля
	Сообщить(СтрШаблон("[AVS DEBUG]: Выбрано: '%1', Определен код: '%2'", ТекЗначение, КодТипа));
	
	// Определяем необходимость поля JSON
	НуженJSON = (КодТипа = "optionSingle") ИЛИ (КодТипа = "optionList") ИЛИ (КодТипа = "groupLink");
	
	// Управляем видимостью элементов (используем русские имена свойств для надежности)
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("AVS_ВариантыЗначений");
	МассивЭлементов.Добавить("AVS_ЗаполнитьВариантыИз1С"); // Кнопка тоже должна скрываться/появляться
	
	Для Каждого ИмяЭлемента Из МассивЭлементов Цикл
		ЭлементФормы = Элементы.Найти(ИмяЭлемента);
		Если ЭлементФормы <> Неопределено Тогда
			ЭлементФормы.Видимость = НуженJSON;
		КонецЕсли;
	КонецЦикла;
	
	// Используем ПредопределенноеЗначение для работы со ссылочным типом (Перечислением)
	//Если КодТипа = "groupLink" Тогда
	//	
	//	Объект.AVS_ТипСвязки = ПредопределенноеЗначение("Перечисление.AVS_ТипСвязки.groupLink");
	//Иначе
	//	// Если тип изменили на обычный (строка/число), сбрасываем признак связки в "none"
	//	Объект.AVS_ТипСвязки = ПредопределенноеЗначение("Перечисление.AVS_ТипСвязки.none");
	//КонецЕсли;
	
КонецПроцедуры

// { ПРАВКА_КОНЕЦ }

&НаСервереБезКонтекста
Функция AVS_ПолучитьКодТипаНаСервере(Значение)
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда Возврат ""; КонецЕсли;
	
	// 1. Если это уже строка (как в ТЗ), просто возвращаем
	Если ТипЗнч(Значение) = Тип("Строка") Тогда Возврат Значение; КонецЕсли;
	
	// 2. Если это перечисление - определяем код "мягким" поиском по имени метаданных
	// Это защитит от ошибки "Предопределенный элемент отсутствует", если имена в коде и базе не совпали
	Попытка
		ИмяМетаданных = ВРег(Значение.Метаданные().Имя);
		
		Если Найти(ИмяМетаданных, "ОДИНОЧН") > 0 Тогда Возврат "optionSingle";
		ИначеЕсли Найти(ИмяМетаданных, "МНОЖЕСТВ") > 0 Тогда Возврат "optionList";
		ИначеЕсли Найти(ИмяМетаданных, "ГРУПП") > 0 Или Найти(ИмяМетаданных, "СВЯЗ") > 0 Тогда Возврат "groupLink";
		ИначеЕсли Найти(ИмяМетаданных, "СТРОК") > 0 Тогда Возврат "string";
		ИначеЕсли Найти(ИмяМетаданных, "ЧИСЛ") > 0 Тогда Возврат "number";
		КонецЕсли;
	Исключение
		КонецПопытки;
		// 3. Резервный вариант: поиск по представлению (синониму)
	Представление = ВРег(Строка(Значение));
	Если Найти(Представление, "ОДИНОЧН") > 0 Тогда Возврат "optionSingle";
	ИначеЕсли Найти(Представление, "МНОЖЕСТВ") > 0 Тогда Возврат "optionList";
	ИначеЕсли Найти(Представление, "ГРУПП") > 0 Или Найти(Представление, "СВЯЗ") > 0 Тогда Возврат "groupLink";
	КонецЕсли;	
	Возврат "";
	
КонецФункции
